{
  "devNote":"Get in line",
  "puzzleId":"1",
  "exitOnfinish": false,
  "hints":[
    {
      "text":"Welcome to the first real puzzle! You will be guided through how puzzles work.",
      "x":0,
      "y":0
    },
    {
      "text":"At the top of the screen you can see a set of puzzle related buttons.",
      "x":0,
      "y":0,
      "ax":0,
      "ay":115,
      "rotz":0
    },
    {
      "text":"The Info is shown on hover and opens up a window with additional info that can be helpful for solving the puzzle. It is only available on some puzzles.",
      "x":0,
      "y":0,
      "ax":130,
      "ay":195,
      "rotz":90
    },
    {
      "text":"The Objective is shown on click and tells you in plain text what the puzzle requires.",
      "x":0,
      "y":0,
      "ax":55,
      "ay":135,
      "rotz":0
    },
    {
      "text":"The Check Logic button checks your current creation against the Truth Table to determine if it satisfies the objective. Click to activate.",
      "x":0,
      "y":0,
      "ax":20,
      "ay":135,
      "rotz":0
    },
    {
      "text":"The Step Logic button goes through each input-combination in increments. Which means you can see how your creation interacts with input on a step by step basis. Click to activate.",
      "x":0,
      "y":0,
      "ax":-20,
      "ay":135,
      "rotz":0
    },
    {
      "text":"The Truth Table is shown on hover. It shows what input is required for a given output.",
      "x":0,
      "y":0,
      "ax":-55,
      "ay":135,
      "rotz":0
    },
    {
      "text":"Now, in this game you will place tiles (for example wires) which can either be POWERED (green) or NOT POWERED (red).",
      "x":0,
      "y":0,
      "ax":0,
      "ay":0,
      "rotz":0
    },
    {
      "text":"Powered tiles will send its signal to other tiles you have connected to them.",
      "x":0,
      "y":0,
      "ax":0,
      "ay":0,
      "rotz":0
    },
    {
      "text":"There are 2 locked tiles on the grid, 'A' and '1'. 'A' is an output, which means it will be powered when you click the Check Logic Button.",
      "x":0,
      "y":0,
      "ax":0,
      "ay":0,
      "rotz":0
    },
    {
      "text":"'1' is the input, which means it is where you have to connect your wires to.",
      "x":0,
      "y":0,
      "ax":0,
      "ay":0,
      "rotz":0
    },
    {
      "text":"That is all you need to get started! Give it a try on this puzzle and good luck on your Boolean journey!",
      "x":0,
      "y":0
    }
  ]
}
